sskoog/ble_audio/apps/usb_ble_bumble/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHFREQ="40m"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# CPU Frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# FreeRTOS 1000Hz
CONFIG_FREERTOS_HZ=1000

# Disable console logs on UART0 to maintain pure binary H4 protocol
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_UART_NUM=-1
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_BOOTLOADER_LOG_LEVEL=0
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL=0

# Bluetooth Controller Configuration with VHCI support
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

CONFIG_BT_LE_50_FEATURE_SUPPORT=y
CONFIG_BT_LE_EXT_ADV=y
CONFIG_BT_LE_ENABLE_PERIODIC_ADV=y
CONFIG_BT_LE_PERIODIC_ADV_SYNC_TRANSFER=y
CONFIG_BT_LE_MAX_EXT_ADV_INSTANCES=4
CONFIG_BT_LE_EXT_ADV_MAX_SIZE=1650

# BLE Controller buffer sizing
CONFIG_BT_LE_MSYS_1_BLOCK_COUNT=24
CONFIG_BT_LE_MSYS_2_BLOCK_COUNT=48
CONFIG_BT_LE_ACL_BUF_COUNT=40
CONFIG_BT_LE_ACL_BUF_SIZE=517
CONFIG_BT_LE_HCI_EVT_BUF_SIZE=257
CONFIG_BT_LE_HCI_EVT_HI_BUF_COUNT=40
CONFIG_BT_LE_HCI_EVT_LO_BUF_COUNT=16
